app/controllers/hardwares_controller.rb

	def index
		@hardwares = Hardware.all
---
SELECT "hardwares".* FROM "hardwares"

	def show
    	@hardware = Hardware.find(params[:id])
---
SELECT  "hardwares".* FROM "hardwares" WHERE "hardwares"."id" = ? LIMIT 1  [["id", 1]]

	def edit
  		@hardware = Hardware.find(params[:id])
---
SELECT  "hardwares".* FROM "hardwares" WHERE "hardwares"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@hardware = Hardware.new(hardware_params)

  		if @hardware.save
---
INSERT INTO "hardwares" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "boom"], ["description", "this will work"], ["created_at", "2015-09-19 16:41:05.824054"], ["updated_at", "2015-09-19 16:41:05.824054"]]

	def update
  		@hardware = Hardware.find(params[:id])

  		if @hardware.update(hardware_params)
---
SELECT  "hardwares".* FROM "hardwares" WHERE "hardwares"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "hardwares" SET "description" = ?, "updated_at" = ? WHERE "hardwares"."id" = ?  [["description", "hdshah"], ["updated_at", "2015-09-19 17:03:06.338074"], ["id", 1]]