app/controllers/main_controller.rb

SELECT "hardwares".* FROM "hardwares"
---
  def inventory
  	@hardwares = []
  	Hardware.all.each do |hardware|